_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 26, 64)            384       
_________________________________________________________________
batch_normalization (BatchNo (None, 26, 64)            256       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 13, 64)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 11, 64)            12352     
_________________________________________________________________
batch_normalization_1 (Batch (None, 11, 64)            256       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 6, 64)             0         
_________________________________________________________________
flatten (Flatten)            (None, 384)               0         
_________________________________________________________________
dropout (Dropout)            (None, 384)               0         
_________________________________________________________________
dense (Dense)                (None, 128)               49280     
_________________________________________________________________
dense_1 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 66        
=================================================================
Total params: 66,722
Trainable params: 66,466
Non-trainable params: 256
_________________________________________________________________
