_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_3 (Conv1D)            (None, 60, 32)            96        
_________________________________________________________________
batch_normalization_3 (Batch (None, 60, 32)            128       
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 30, 32)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 30, 32)            3104      
_________________________________________________________________
batch_normalization_4 (Batch (None, 30, 32)            128       
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 15, 32)            0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 15, 32)            3104      
_________________________________________________________________
batch_normalization_5 (Batch (None, 15, 32)            128       
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 8, 32)             0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_4 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 66        
=================================================================
Total params: 43,778
Trainable params: 43,586
Non-trainable params: 192
_________________________________________________________________
