_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_40 (Conv1D)           (None, 30, 32)            96        
_________________________________________________________________
batch_normalization_43 (Batc (None, 30, 32)            128       
_________________________________________________________________
max_pooling1d_38 (MaxPooling (None, 15, 32)            0         
_________________________________________________________________
conv1d_41 (Conv1D)           (None, 15, 32)            3104      
_________________________________________________________________
batch_normalization_44 (Batc (None, 15, 32)            128       
_________________________________________________________________
max_pooling1d_39 (MaxPooling (None, 8, 32)             0         
_________________________________________________________________
conv1d_42 (Conv1D)           (None, 8, 32)             3104      
_________________________________________________________________
batch_normalization_45 (Batc (None, 8, 32)             128       
_________________________________________________________________
max_pooling1d_40 (MaxPooling (None, 4, 32)             0         
_________________________________________________________________
flatten_18 (Flatten)         (None, 128)               0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_54 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_55 (Dense)             (None, 32)                4128      
_________________________________________________________________
dense_56 (Dense)             (None, 2)                 66        
=================================================================
Total params: 27,394
Trainable params: 27,202
Non-trainable params: 192
_________________________________________________________________
