_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_9 (Conv1D)            (None, 26, 64)            384       
_________________________________________________________________
batch_normalization_9 (Batch (None, 26, 64)            256       
_________________________________________________________________
max_pooling1d_9 (MaxPooling1 (None, 13, 64)            0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 11, 64)            12352     
_________________________________________________________________
batch_normalization_10 (Batc (None, 11, 64)            256       
_________________________________________________________________
max_pooling1d_10 (MaxPooling (None, 6, 64)             0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 4, 64)             12352     
_________________________________________________________________
batch_normalization_11 (Batc (None, 4, 64)             256       
_________________________________________________________________
max_pooling1d_11 (MaxPooling (None, 2, 64)             0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 128)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_10 (Dense)             (None, 32)                4128      
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 66        
=================================================================
Total params: 46,562
Trainable params: 46,178
Non-trainable params: 384
_________________________________________________________________
