_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 90, 32)            96        
_________________________________________________________________
batch_normalization (BatchNo (None, 90, 32)            128       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 45, 32)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 45, 32)            3104      
_________________________________________________________________
batch_normalization_1 (Batch (None, 45, 32)            128       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 23, 32)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 23, 32)            3104      
_________________________________________________________________
batch_normalization_2 (Batch (None, 23, 32)            128       
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 12, 32)            0         
_________________________________________________________________
flatten (Flatten)            (None, 384)               0         
_________________________________________________________________
dropout (Dropout)            (None, 384)               0         
_________________________________________________________________
dense (Dense)                (None, 128)               49280     
_________________________________________________________________
dense_1 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 66        
=================================================================
Total params: 60,162
Trainable params: 59,970
Non-trainable params: 192
_________________________________________________________________
