_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 5, 5, 128)         589952    
_________________________________________________________________
batch_normalization_7 (Batch (None, 5, 5, 128)         512       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 3, 3, 64)          73792     
_________________________________________________________________
batch_normalization_8 (Batch (None, 3, 3, 64)          256       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_11 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 130       
=================================================================
Total params: 705,794
Trainable params: 705,410
Non-trainable params: 384
_________________________________________________________________
