_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 86, 64)            384       
_________________________________________________________________
batch_normalization_1 (Batch (None, 86, 64)            256       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 43, 64)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 41, 64)            12352     
_________________________________________________________________
batch_normalization_2 (Batch (None, 41, 64)            256       
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 21, 64)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1344)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1344)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               172160    
_________________________________________________________________
dense_2 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 66        
=================================================================
Total params: 189,602
Trainable params: 189,346
Non-trainable params: 256
_________________________________________________________________
