_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
densenet121 (Model)          multiple                  7037504   
_________________________________________________________________
conv2d (Conv2D)              (None, 5, 5, 64)          589888    
_________________________________________________________________
batch_normalization (BatchNo (None, 5, 5, 64)          256       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 3, 3, 64)          36928     
_________________________________________________________________
batch_normalization_1 (Batch (None, 3, 3, 64)          256       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 2, 2, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 256)               0         
_________________________________________________________________
dense (Dense)                (None, 256)               65792     
_________________________________________________________________
dense_1 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 130       
=================================================================
Total params: 7,747,202
Trainable params: 709,442
Non-trainable params: 7,037,760
_________________________________________________________________
