_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 5, 5, 128)         589952    
_________________________________________________________________
batch_normalization_3 (Batch (None, 5, 5, 128)         512       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 3, 3, 64)          73792     
_________________________________________________________________
batch_normalization_4 (Batch (None, 3, 3, 64)          256       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 256)               65792     
_________________________________________________________________
dense_5 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_6 (Dense)              (None, 2)                 130       
=================================================================
Total params: 746,882
Trainable params: 746,498
Non-trainable params: 384
_________________________________________________________________
