_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 26, 64)            384       
_________________________________________________________________
batch_normalization (BatchNo (None, 26, 64)            256       
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 13, 64)            0         
_________________________________________________________________
flatten (Flatten)            (None, 832)               0         
_________________________________________________________________
dropout (Dropout)            (None, 832)               0         
_________________________________________________________________
dense (Dense)                (None, 128)               106624    
_________________________________________________________________
dense_1 (Dense)              (None, 32)                4128      
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 66        
=================================================================
Total params: 111,458
Trainable params: 111,330
Non-trainable params: 128
_________________________________________________________________
