_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 5, 5, 64)          294976    
_________________________________________________________________
batch_normalization_10 (Batc (None, 5, 5, 64)          256       
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 3, 3, 64)          0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 576)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 256)               147712    
_________________________________________________________________
dense_17 (Dense)             (None, 64)                16448     
_________________________________________________________________
dense_18 (Dense)             (None, 2)                 130       
=================================================================
Total params: 459,522
Trainable params: 459,394
Non-trainable params: 128
_________________________________________________________________
