_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_13 (Conv2D)           (None, 5, 5, 128)         589952    
_________________________________________________________________
batch_normalization_13 (Batc (None, 5, 5, 128)         512       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 3, 3, 64)          73792     
_________________________________________________________________
batch_normalization_14 (Batc (None, 3, 3, 64)          256       
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_20 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_21 (Dense)             (None, 2)                 130       
=================================================================
Total params: 705,794
Trainable params: 705,410
Non-trainable params: 384
_________________________________________________________________
