_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 5, 5, 128)         589952    
_________________________________________________________________
batch_normalization_9 (Batch (None, 5, 5, 128)         512       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 3, 3, 128)         0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 1152)              0         
_________________________________________________________________
dense_13 (Dense)             (None, 128)               147584    
_________________________________________________________________
dense_14 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_15 (Dense)             (None, 2)                 130       
=================================================================
Total params: 746,434
Trainable params: 746,178
Non-trainable params: 256
_________________________________________________________________
